In [1]:
# revision

In [2]:
import numpy as np
import pandas as pd

In [3]:
# https://pandas.pydata.org/docs/user_guide/merging.html

In [5]:
a = pd.read_csv('a.csv')

In [6]:
b = pd.read_csv('b.csv')

In [7]:
a

    A   B
0  10  20
1  30  40

In [8]:
b

    A   C
0  10  20
1  30  40

In [10]:
pd.concat([a,b])

    A     B     C
0  10  20.0   NaN
1  30  40.0   NaN
0  10   NaN  20.0
1  30   NaN  40.0

In [11]:
pd.concat([a,b],axis=0) #default axis is 0

    A     B     C
0  10  20.0   NaN
1  30  40.0   NaN
0  10   NaN  20.0
1  30   NaN  40.0

In [13]:
data = pd.concat([a,b],axis=1) # changing the  axis to 1 for side by side stacking

In [14]:
data

    A   B   A   C
0  10  20  10  20
1  30  40  30  40

In [16]:
# data.iloc[rows,col]
data.iloc[:,1]

0    20
1    40
Name: B, dtype: int64

In [17]:
data.iloc[:,1:3]

    B   A
0  20  10
1  40  30

In [18]:
data = pd.concat([a,b],axis=0,join='inner')

In [19]:
data

    A
0  10
1  30
0  10
1  30

In [20]:
data = pd.concat([a,b],axis=0,join='outer') #default join is outer

In [21]:
data

    A     B     C
0  10  20.0   NaN
1  30  40.0   NaN
0  10   NaN  20.0
1  30   NaN  40.0

In [28]:
data1 = pd.concat([a,b],axis=1,join='inner')

In [29]:
data1

    A   B   A   C
0  10  20  10  20
1  30  40  30  40

# Merging

In [30]:
a

    A   B
0  10  20
1  30  40

In [31]:
b

    A   C
0  10  20
1  30  40

In [34]:
a.merge(b) # intelligent method , logically joining the two dataframes

    A   B   C
0  10  20  20
1  30  40  40

In [33]:
pd.concat([a,b])

    A     B     C
0  10  20.0   NaN
1  30  40.0   NaN
0  10   NaN  20.0
1  30   NaN  40.0

In [37]:
user = pd.DataFrame({'userid' : [1,2,3],'name': ['A','B','C']})

In [38]:
user

   userid name
0       1    A
1       2    B
2       3    C

In [41]:
msg = pd.DataFrame({'id':[1,2,2],'msg' : ['hello','bye','hi']})

In [42]:
msg

   id    msg
0   1  hello
1   2    bye
2   2     hi

In [44]:
pd.concat([user,msg])

   userid name   id    msg
0     1.0    A  NaN    NaN
1     2.0    B  NaN    NaN
2     3.0    C  NaN    NaN
0     NaN  NaN  1.0  hello
1     NaN  NaN  2.0    bye
2     NaN  NaN  2.0     hi

In [45]:
pd.concat([user,msg],axis=1)

   userid name  id    msg
0       1    A   1  hello
1       2    B   2    bye
2       3    C   2     hi

In [48]:
msg.merge(user,left_on='id',right_on='userid',how='inner') #default in inner join

   id    msg  userid name
0   1  hello       1    A
1   2    bye       2    B
2   2     hi       2    B

In [49]:
msg.merge(user,left_on='id',right_on='userid',how='outer')

    id    msg  userid name
0  1.0  hello       1    A
1  2.0    bye       2    B
2  2.0     hi       2    B
3  NaN    NaN       3    C

In [51]:
msg.merge(user,left_on='id',right_on='userid',how='outer').drop('id',axis=1)

     msg  userid name
0  hello       1    A
1    bye       2    B
2     hi       2    B
3    NaN       3    C